/**
 * ============================================================================
 * ЗАДАНИЕ 4: Сегментация по цвету в HSV пространстве
 * ============================================================================
 * Цель:
 *   1. Определить HSV-диапазон для выбранного цвета
 *   2. Создать бинарную маску через inRange()
 *   3. Выделить объект на исходном изображении через bitwise_and()
 * 
 * Почему HSV лучше BGR для сегментации:
 *   - H (Hue) отвечает за цвет, не зависит от освещения
 *   - S (Saturation) и V (Value) можно настроить под яркость
 *   - В BGR цвет смешан из 3 каналов, сложнее выделить
 * ============================================================================
 */

#include <opencv2/opencv.hpp>
#include <iostream>

using namespace cv;
using namespace std;

/**
 * @brief Структура для хранения диапазона цвета в HSV
 * 
 * @details
 *   HSV диапазоны в OpenCV:
 *   - H: 0-179 (реально 0-360°, делится на 2)
 *   - S: 0-255 (насыщенность)
 *   - V: 0-255 (яркость)
 */
struct HSVRange {
    string name;    // Название цвета
    Scalar lower;   // Нижний порог [H, S, V]
    Scalar upper;   // Верхний порог [H, S, V]
};

int main() {
    // === ИНИЦИАЛИЗАЦИЯ КАМЕРЫ ===
    VideoCapture cap(0);
    if (!cap.isOpened()) {
        cerr << "❌ Ошибка открытия камеры!" << endl;
        return -1;
    }

    // === НАСТРОЙКА РАЗРЕШЕНИЯ КАМЕРЫ ===
    // Уменьшаем разрешение для повышения FPS
    cap.set(CAP_PROP_FRAME_WIDTH, 640);
    cap.set(CAP_PROP_FRAME_HEIGHT, 480);

    // === ОПРЕДЕЛЕНИЕ HSV ДИАПАЗОНОВ ДЛЯ ЦВЕТОВ ===
    vector<HSVRange> colors = {
        // Синий: H=100-140 (в OpenCV), S и V от 50 до 255
        {"Blue",   Scalar(100, 50, 50), Scalar(140, 255, 255)},
        
        // Красный: H=0-10 (первый диапазон)
        {"Red",    Scalar(0, 50, 50),   Scalar(10, 255, 255)},
        
        // Красный: H=170-180 (второй диапазон, т.к. красный на границе спектра)
        {"Red2",   Scalar(170, 50, 50), Scalar(180, 255, 255)},
        
        // Зелёный: H=35-85
        {"Green",  Scalar(35, 50, 50),  Scalar(85, 255, 255)},
    };

    // === СОЗДАНИЕ ОКОН ===
    namedWindow("Original", WINDOW_NORMAL);
    namedWindow("Mask", WINDOW_NORMAL);
    namedWindow("Result", WINDOW_NORMAL);

    Mat frame, hsv, mask, result;
    int color_idx = 0; // Индекс текущего цвета (0=Blue)

    cout << "✅ Задание 4 запущено.\n";
    cout << "📌 Клавиши: 1=Blue, 2=Red, 3=Green, q=выход\n";

    // === ОСНОВНОЙ ЦИКЛ ===
    while (true) {
        // Захват кадра
        cap >> frame;
        
        // Пропускаем пустые кадры (защита от сбоев камеры)
        if (frame.empty()) {
            continue;
        }

        // Проверка типа изображения (должно быть BGR, 3 канала)
        if (frame.type() != CV_8UC3) {
            cerr << "⚠ Неверный тип кадра!" << endl;
            break;
        }

        // === КОНВЕРТАЦИЯ BGR → HSV ===
        try {
            cvtColor(frame, hsv, COLOR_BGR2HSV);
        } catch (const cv::Exception& e) {
            cerr << "⚠ Ошибка конвертации: " << e.what() << endl;
            continue;
        }

        // Получаем текущий диапазон цвета
        HSVRange current = colors[color_idx];
        
        // === СОЗДАНИЕ БИНАРНОЙ МАСКИ ===
        try {
            // Для красного цвета нужно объединить два диапазона
            // (красный находится на границе 0° и 360°)
            if (current.name == "Red") {
                Mat mask1, mask2;
                // Первый диапазон красного (0-10)
                inRange(hsv, colors[1].lower, colors[1].upper, mask1);
                // Второй диапазон красного (170-180)
                inRange(hsv, colors[2].lower, colors[2].upper, mask2);
                // Объединяем маски (логическое ИЛИ)
                bitwise_or(mask1, mask2, mask);
            } else {
                // Для остальных цветов достаточно одного диапазона
                inRange(hsv, current.lower, current.upper, mask);
            }

            // === ВЫДЕЛЕНИЕ ОБЪЕКТА НА ИСХОДНОМ ИЗОБРАЖЕНИИ ===
            // bitwise_and оставляет только пиксели, где маска = 255 (белый)
            // Остальные пиксели становятся чёрными
            bitwise_and(frame, frame, result, mask);
        } catch (const cv::Exception& e) {
            cerr << "⚠ Ошибка обработки: " << e.what() << endl;
            continue;
        }

        // === ОТОБРАЖЕНИЕ РЕЗУЛЬТАТОВ ===
        imshow("Original", frame);  // Исходный кадр
        imshow("Mask", mask);       // Бинарная маска (чёрно-белая)
        imshow("Result", result);   // Выделенный объект

        // === ОБРАБОТКА КЛАВИШ ===
        char key = waitKey(30);
        if (key == 'q' || key == 27) break; // Выход
        
        // Переключение цвета
        if (key == '1') { 
            color_idx = 0; 
            cout << "🔵 Выбран: Blue\n"; 
        }
        if (key == '2') { 
            color_idx = 1; 
            cout << "🔴 Выбран: Red\n"; 
        }
        if (key == '3') { 
            color_idx = 3; 
            cout << "🟢 Выбран: Green\n"; 
        }
    }

    // === ОСВОБОЖДЕНИЕ РЕСУРСОВ ===
    cap.release();
    destroyAllWindows();
    
    cout << "✅ Задание 4 завершено.\n";
    return 0;
}